{"content":"PRIVATE SECTOR POWER GENERATION POLICY OF BANGLADESH MINISTRY OF ENERGY AND MINERAL RESOURCES GOVERNMENT OF THE PEOPLE’S REPUBLIC OF BANGLADESH OCTOBER 1996 REVISED NOVEMBER 2004 DHAKA","metadata":{"source":"data/raw/policy.pdf","page":0,"ingested_at":"2025-12-28T17:51:32.463038"}}
{"content":"CONTENTS Page 1.0 INTRODUCTION ..........................................................................................................1 2.0 GOB POLICY AND THE POWER CELL..................................................................2 3.0 MODALITY FOR IMPLEMENTATI ON OF INDEPENDENT POWER ............... PROJECTS .....................................................................................................................2 One Window Operation ................................................................................................2 Solicitation of Proposals ................................................................................................2 Financing Arrangements ..............................................................................................3 Security Package ............................................................................................................3 Allocation of Project/Plant Site and Provision of Fuel ...............................................4 4.0 TARIFF FOR BULK PURCHASE OF POWER AT BUSBAR ...............................4 5.0 FISCAL INCENTIVES .................................................................................................5 6.0 OTHER FACILITIES AND INCENT IVES FOR FOREIGN INVESTORS...........6 7.0 ISSUE OF SEPARATE STATUTORY REGULATORY ORDER (SRO) ..............7 8.0 RIGHT OF INTERPRETATION.................................................................................7","metadata":{"source":"data/raw/policy.pdf","page":1,"ingested_at":"2025-12-28T17:51:32.463092"}}
{"content":"1.0 INTRODUCTION 1.1 Bangladesh needs to achieve and sustain an annual economic growth rate of at least 6/7 percent to alleviate poverty and realize desirable socio- economic and human development. To achieve the growth target of GDP, it is absolutely essential that the minimum electricity growth rate is maintained at a factor of 1.5 of GDP growth. The provision of adequate and reliable supply of electricity at a reasonable cost is a pre-requisite to attain this goal. Besides, Bangladesh is still at a very low level of electrification, with only 15 percent of its population (about 120 million) having access to electricity and per capita generation is only 95 Kwh per annum. Hence, there is a great ne ed to expand the electrification programme. The government of Bangladesh (GOB) recognizes that the pace of power development has to be accelerated in order to achieve overall economic development targets of th e country and avoid looming power shortages. Power is the prime mover. Any big push of the economy would need accelerated power development. 1.2 Presently, three state-owned utilities under the Ministry of Energy and Mineral Resources are responsible for electricity development in the country. These are: i) Bangladesh Power Development Board (BPDB), responsible for generation and transmission of power in the country and distribution in urban areas except the area under Greater Dhaka; ii) Dhaka Electric Supply Authority (DESA), responsible for distribution of electricity in the greater Dhaka area including the metropolitan city of Dhaka; and iii) Rural Electrification Board (REB), responsible for distribution of electricity in rural areas. 1.3 In comparison to the 11666 GWh electri city generated annually at present, the Power System Master Plan (PSMP) projects a requirement of 16500 GWh in 2000 and 24160 GWh in the year 2005. This implies an increase in peak demand from the present 2200 MW to 3150 MW by 2000 and 4600 MW by 2005 for which capacity addition of about 3350 MW will be required by 2005. Hence on average, additional 300 MW of generation capacity has to be added every year. The total investment between now and 2005, required to achieve such capacity enhancement, is Taka 176 billion or US$ 4.4 billion. The corresponding investment requirement for expansion & reinforcement of transmission and distribution system would be about US$ 2.2 billion for the same period, bringing the grand total to US$ 6.6 billion. 1.4 The likelihood of securing such a substantial volume of investment for power generation alone through the public sector is remote. Besides, competing demands on government resources and declining levels of external assistance from multilater al/bilateral donor agencies further","metadata":{"source":"data/raw/policy.pdf","page":2,"ingested_at":"2025-12-28T17:51:32.463193"}}
{"content":"constrain the potential for public investment in the power sector. Recognizing these trends, GOB amended its industrial policy to enable private investment in the power sector. GOB also adopted the recommendations contained in the report on Power Sector Reforms, prepared by a high level Inter-Ministerial Working Group, for restructuring the power sector and promoting private se ctor participation in the generation of electricity in order to attain higher economic efficiency. The Government is strongly committed to attract private investment for installing new power generation capacity on a build-own-operate (BOO) basis. 2.0 GOB POLICY AND THE POWER CELL In order to translate this explicit pol icy commitment into actual investment projects, GOB created and set up a Power Cell under the Ministry of Energy & Mineral Resources (MEMR) in 1995. The Power Cell has a mandate to lead private power development, recommend power sector reforms & restructuring, conduct study on tariffs and formulation of a regulatory framework for the power sector. The Power Cell shall facilitate all stages of promotion, development, implementation, commissioning and operations of private power generation projects and suitably address the concerns of project sponsors. It will also assist project sponsors to secure necessary consents and permits from GOB where such consents and permits would be needed. 3.0 MODALITY FOR IMPLEMENTATION OF PRIVATE POWER PROJECTS 3.1 One Window Operation : The designated institution to facilitate the development of private sector power projects shall be the Power Cell, MEMR. The Power Cell shall articulate and promote the private power policy of GOB and shall solicit and evaluate proposals, negotiate a nd process award of contracts, and finalize various agreements related to these projects. The Power Cell would also represent GOB interest in private power projects. 3.2 Solicitation of Proposals : Independent Power Producers’ (IPP ) projects will be implemented on Build-own-operate (BOO) basis. International solicitation for specific projects will be processed by the Powe r Cell. The pre-qualification of the bidders will be made through advertisements in the national and international press. The evaluation criteria for pre-qualification will be given along with the pre-qualification documents to be issued to the intending bidders. The RFP (Request For Proposal) documents will be issued only to pre-qualified bidders. After final evaluation of commercial bids from pre-qualified sponsors they will be ranked as per criteria set in the RFP. The first ranked bidder will be given a stipulated period to: (a) submit a performance guarantee and (b) reach financial closure. Failure to perform in either case will result in","metadata":{"source":"data/raw/policy.pdf","page":3,"ingested_at":"2025-12-28T17:51:32.463304"}}
{"content":"forfeiture of the guarantee, if any, and an invitation to the second ranked bidder, under similar conditions. The RFP may include provision for time extension for financial closure, subject to an increase in the performance guarantee amount. In the event of a sponsor chosen on the basis of an unsolicited proposal, similar provisi ons on performance guarantees and specified time period for financial closure will apply. 3.3 Financing Arrangements : (a) BOO projects may involve limited recourse financing and the funds for the projects will be raised without any direct sovereign guarantee of repayment. Instead, the investors and lenders to the project sponsor(s) must look to the revenues earned by the sale of electricity for their returns on equity and debt servicing. (b) Minimum requirement for equity investment will be 20 percent. (c) The Government of Bangladesh may establish a Private Sector Infrastructure Development Fund (PSIDF), with the assistance of the World Bank and or other aid agencies, which may provide part of the capital cost of the project as subordinated debt. The debt would be available on market based interest rates and carry extended maturity periods. (d) To facilitate the creation and encouragement of a corporate debt securities market essential for raising local fina ncing for power development projects, the following provisions will be allowed: i) Permission to power generating companies to issue Corporate Bonds both bearer and registered with the consent of the Securities and Exchange Commission (SEC). ii) Permission to issue shares at discounted prices upto the limit of 10% of the face value to en able venture capitalists to be provided higher rates of return proportionate to the risks. iii) Permission to foreign banks to underwrite the issue of shares and bonds by the private power companies with the recognition by SEC of such underwriting. iv) Tax facilities for private sector instruments as available to Non-Banking Financial Institutions. v) Modification of Prudential Regulations to allow 80:20 debt equity ratio, if necessary. 3.4 Security Package : (a) Model Implementation Agre ement (IA), Power Purchase Agreement (PPA) and Fuel Supply Agreement (FSA) will be prepared for private power projects to eliminate the need for protracted negotiations between GOB and Sponsors.","metadata":{"source":"data/raw/policy.pdf","page":4,"ingested_at":"2025-12-28T17:51:32.463388"}}
{"content":"(b) The Power Purchase Agreemen t (if executed by Government Agencies) will be guaranteed by the GOB for performance obligations of the concerned utilities. (c) In case the fuel is to be supplied by a public sector organisation, the performance of the fuel supplier will be guaranteed by the GOB under the terms of Fuel Supply Agreement. (d) For private power projects the Government will provide: i) Standard protection against specific force majeure risk. ii) Protection against changes in certain taxes and duties. 3.5 Allocation of Project/Plant Site and Provision of Fuel : The plant sites will be selected by GOB in consultation with the investor/project sponsor. Fuel for such projects will be determined by GOB keeping in view preference for indigenous resources like Natural Gas, Coal and any other fossil fuels. However, in case of any limitations, if and when deemed necessary, GOB may also allow other fossil fuels including imported fuels. A fuel supply agreement in that event will be entered into by the project sponsors and fuel supplie r. Investors may also be asked to bid for projects based on hydro or other renewable and/or non-conventional sources of energy, such as the sun, wind, biomass etc. For such projects, IA & PPA would be different, for obvious reasons. 4.0 TARIFF FOR BULK PURCHASE OF POWER AT BUSBAR 4.1 The power produced by the IPP shall be purchased (as per Power Purchase Agreement) by BPDB/DESA/REB or any other transmission or distribution company which may be established in future, or any large consumer. The Power Cell as the GOB agent will indicate which organisation will be the power purchaser at the time of issuance of RFP. The tariff structure would consist of two parts: (a) Capacity Payment: This will cover debt service, return on equity, fixed operation and maintenance cost, insurance and other fixed costs. The capacity payment would be further divided into an escalating non-escalating portions. The capacity payment will be made in Bangladesh currency (Taka), but denominated in both dollars (to repay foreign loans and fixed costs) and local currency (to repay local loans and investment and local fixed costs). The capacity payment will be linked to a certain level of availability of the power plant which will be made known to the bidders at the time of issuance of RFP. (b) Energy Payment: This will cover the variable costs of operation and maintenance, including fuel and be paid in Taka. The payment","metadata":{"source":"data/raw/policy.pdf","page":5,"ingested_at":"2025-12-28T17:51:32.463478"}}
{"content":"would be further divided into fuel component which would be a pass-through and a non-fuel component which escalates. The energy payment will be denominated in local currency to the extent to which the variable costs are in local currency. 4.2 In the solicited bids, the bidders sh all offer bulk power tariff based on the capacity payment and energy payment and also provide the equivalent levelized tariff over the contract period in US cents/Kwh (to be paid in Taka), based on discount rate, tariff prof ile restriction and plant factor to be specified during the solicitation of bids. The evaluation will be based on the criteria to be provided in the RFP. 4.2.1 In case of Small Power Plant (SPP) upto 30 MW Installed capacity promoted by the local entrepreneur, the bidders will be allowed to provide the equivalent levelized tariff over the contract period in taka/ Kwh. The evaluation will be based on the criteria to be provided in the Request For Proposal (RFP). 4.3 The sponsors of private power project will provide year wise tariff profile over the contract period in a manner that will match their annual debt service requirements. 4.4 A mechanism shall be provided for the adjustments of certain tariff components to variations in Taka/ Dollar exchange rate, fuel price and inflation rates. In determining this adjustment/indexation, the issue of efficiency gains would be taken into consideration. 4.5 Interconnection of IPP to Transmission System : The power will be purchased from the IPP at a specified voltage at the outgoing terminal (interconnection point) of the sub-station of the power plant. The transmission line for interconnection with the national grid will be provided by the appropriate agency. The costs of interconnecting facilities upto outgoing terminals of the private power projects (including step up auto transformers, circuit breakers and associated switchgear) will be borne by the private power producers. 5.0 FISCAL INCENTIVES 5.1 The private power companies shall be exempt from corporate income tax for a period of 15 years. 5.2 The companies will be allowed to import plant and equipment and spare parts up to a maximum of ten percent (10%) of the original value of total plant and equipment within a period of twelve (12) years of Commercial Operation without payment of customs duties, VAT (Value Added Tax) and any other surcharges as well as import permit fee except for indigenously produced equipment manufactured according to international standards.","metadata":{"source":"data/raw/policy.pdf","page":6,"ingested_at":"2025-12-28T17:51:32.463567"}}
{"content":"5.3 Repatriation of equity along with dividends will be allowed freely. 5.4 Exemption from income tax in Bangladesh for foreign lenders to such companies. 5.5 The foreign investors will be free to enter into joint ventures but this is optional and not mandatory. 5.6 The companies will be exempted from the requirements of obtaining insurance/reinsurance only from the Na tional Insurance Company, namely Sadharan Bima Corporation (SBC). Private power companies will be allo wed to buy insurance of their choice as per requirements of the lenders and the utilities. 5.7 The Instruments and Deeds required to be registered under local regulations will be exempted from stamp duty payments. 5.8 Power generation has been declared as an industry and the companies are eligible for all other concessions which are available to industrial projects. 5.9 The private parties may raise local and foreign finance in accordance with regulations applicable to industrial pr ojects as defined by the Board of Investment (BOI). 5.10 Local engineering and manufacturing companies shall be encouraged to provide indigenously manufactured equipm ent of international standard to private power plants. 6.0 OTHER FACILITIES AND INCENTIVES FOR FOREIGN INVESTORS The following facilities and incentives would be provided to private power producers: 6.1 Tax exemption on royalties, technical know-how and technical assistance fees, and facilities fo r their repatriation. 6.2 Tax exemption on interest on foreign loans. 6.3 Tax exemption on capital gains from transfer of shares by the investing company. 6.4 Avoidance of double taxation in case of foreign investors on the basis of bilateral agreements. 6.5 Exemption of income tax for upto three years for the expatriate personnel employed under the approved industry.","metadata":{"source":"data/raw/policy.pdf","page":7,"ingested_at":"2025-12-28T17:51:32.463632"}}
{"content":"6.6 Remittance of upto 50% of salary of the foreigners employed in Bangladesh and facilities for repatriati on of their savings and retirement benefits at the time of their return. 6.7 No restrictions on issuance of wo rk permits to project related foreign nationals and employees. 6.8 Facilities for repatriation of inve sted capital, profits and dividends. 6.9 Provision of transfer of shares held by foreign shareholders to local shareholders/ investors. 6.10 TAKA, the national currency, woul d be convertible for international payments in current account. 6.11 Re-investment of remittable dividend to be treated as new foreign investment. 6.12 Foreign owned companies duly registered in Bangladesh will be on the same footing as locally owned companies with regard to borrowing facilities. 7.0 ISSUE OF SEPARATE STATUTORY REGULATORY ORDER (SRO) A separate SRO will be issued for private sector power plants so that the incentives and concessions given under various regula tions and directives are consolidated and placed together in one document. 8.0 RIGHT OF INTERPRETATION In case of any ambiguity with regard to interpretation of any provision of this policy document, the GOB interpretation shall be final.","metadata":{"source":"data/raw/policy.pdf","page":8,"ingested_at":"2025-12-28T17:51:32.463678"}}
{"content":"GLOSSARY OF ABBREVIATIONS/ ACRONYMS/ TERMS BPDB - Bangladesh Power Development Board. BOI - Board of Investment. BOO - Build-Own-Operate. DESA - Dhaka Electric Supply Authority. FSA - Fuel Supply Agreement. GDP - Gross Domestic Product. GOB - Government of Bangladesh. IA - Implementation Agreement. IPP - Independent Power Producer. MEMR - Ministry of Energy & Mineral Resources. PPA - Power Purchase Agreement. PSIDF - Private Sector Infrastructure Development Fund. PSMP - Power System Master Plan. REB - Rural Electrification Board. RFP - Request for Proposal. SBC - Sadharan Bima Corporation (A public sector general insurance company). SPP - Small Power Plant. SRO - Statutory Regulatory Order. VAT - Value Added Tax.","metadata":{"source":"data/raw/policy.pdf","page":9,"ingested_at":"2025-12-28T17:51:32.463707"}}
